<template>
  <div style="height:1000px">
    <div>
      <img src="https://krasual.lviv.ua/wp-content/themes/theme/images/logo.png" alt="">
    </div>
    <div style="background: #282626;color:indianred;width:550px;margin-top: 200px;margin-left: 500px;">
      <p>Ласкаво
      просимо в салон краси «Krasual`» у Львові. Сучасний салон краси допомагає втілити природне бажання людини – добре
      виглядати, залишатися красивою і бажаною. Ми раді запропонувати Вам великий спектр послуг по догляду за тілом,
      волоссям, нігтями та обличчям. Сучасне обладнання, якісна косметика відомих брендів і золоті руки наших майстрів,
      дозволять втілити побажання навіть найвибагливіших шанувальників краси. Ми знаємо секрет, як підкреслити вашу
      природну привабливість і уповільнити плин часу. У нашому салоні краси завжди по-домашньому затишна і доброзичлива
      атмосфера, увага і турбота про кожного клієнта. Це те місце, куди вам захочеться повернутися знову і знову.
      Довіртеся нам, ми гарантуємо, що ви будете задоволені. Нам важливо бути кращими.
      Кожному нашому клієнту відмінний настрій на цілий день в подарунок!</p>
    </div>
  </div>
</template>

<script>
export default {
  name: "Home"
}
</script>

<style scoped>
div {
  background: url("https://bagira-salon.virtual.ua/images/374829/bagira-salon.virtual.ua_038.jpg") no-repeat;;
}
</style>